export const mbtiDescriptions = {
  ISTJ: 'ISTJ 유형은 책임감이 강하고 신뢰할 수 있는 사람들로, 전통적인 가치와 실용적인 사고를 중요시합니다. 일을 체계적으로 계획하고, 세부 사항을 신경 쓰며, 약속을 철저히 지킵니다. 이들은 안정성을 추구하며, 목표를 달성하기 위해 조직적이고 효율적으로 행동합니다.',
  ISFJ: 'ISFJ 유형은 헌신적이고 따뜻한 성격을 지니며, 타인의 감정과 필요를 잘 이해하고 도와주는 데 능숙합니다. 이들은 세심하고 배려심이 많아 사람들과의 관계에서 신뢰를 얻으며, 조화롭고 안정된 환경을 선호합니다. 전통적이고 실용적인 가치관을 바탕으로, 주변 사람들에게 안락함과 안전감을 제공합니다.',
  INFJ: 'INFJ 유형은 이상주의적이고 통찰력이 뛰어나며, 깊은 인간관계를 중요시하는 사람들입니다. 이들은 직관력과 공감 능력이 뛰어나 타인의 감정을 잘 이해하고 도울 수 있으며, 자신의 내면적 가치와 사명감에 따라 행동합니다. 창의적인 사고와 강한 목표 의식을 바탕으로, 세상을 더 나은 곳으로 만들고자 하는 비전을 갖고 있습니다.',
  INTJ: 'INTJ 유형은 독립적이고 전략적인 사고를 지닌 사람들로, 논리적이고 분석적으로 문제를 해결합니다. 이들은 높은 목표를 설정하고 이를 달성하기 위해 체계적이고 효율적으로 계획을 세우며, 장기적인 시각으로 미래를 바라보는 경향이 있습니다. 목표 달성에 집중하며, 타인과의 관계보다는 성취와 결과를 중시하는 성향이 강합니다.',
  ISTP: 'ISTP 유형은 뛰어난 문제 해결 능력을 가지고 있으며, 논리적이고 현실적인 사고방식으로 실질적인 문제에 대처하는 데 능숙합니다. 이들은 유연하고 적응력이 뛰어나며, 상황에 맞게 행동을 조정하는 능력을 가지고 있습니다. 실험적이고 도전적인 성향을 지니며, 손으로 무언가를 만들거나 문제를 해결하는 데 흥미를 느낍니다.',
  ISFP: 'ISFP 유형은 예술적 감각과 독창성을 중요시하며, 감정을 깊이 느끼고 이를 표현하는 것을 중시합니다. 이들은 조용하고 내성적이지만, 친밀한 사람들과의 관계에서 따뜻하고 다정한 성격을 보입니다. 자유롭고 자율적인 환경을 선호하며, 자신의 감정과 내면의 가치에 따라 행동합니다.',
  INFP: 'INFP 유형은 이상적이고 창의적인 성향을 지닌 사람들로, 내면의 가치와 신념을 중요하게 생각합니다. 이들은 타인의 감정에 공감하고, 세상에 긍정적인 변화를 가져오고자 하는 강한 열망을 가지고 있습니다. 창의적이고 상상력이 풍부하며, 예술적 표현이나 글쓰기를 통해 자신의 생각을 전달하는 것을 좋아합니다.',
  INTP: 'INTP 유형은 논리적이고 분석적인 사고를 지닌 사람들로, 지적 호기심이 매우 강합니다. 이들은 복잡한 문제를 해결하거나 이론적인 개념을 탐구하는 것을 즐기며, 깊이 있는 사고를 통해 새로운 아이디어를 발견하는 데 열중합니다. 독립적이고 비판적인 사고를 지니며, 감정보다는 논리와 합리성을 중시합니다.',
  ESTP: 'ESTP 유형은 활동적이고 실용적인 성향을 지닌 사람들로, 현재의 순간을 즐기며 즉각적인 문제 해결에 능숙합니다. 이들은 위험을 감수하고 순간의 기회를 잡는 것을 두려워하지 않으며, 대인관계에서 매력적이고 설득력이 뛰어납니다. 빠르게 결정을 내리고 즉각적으로 행동하는 성향이 강합니다.',
  ESFP: 'ESFP 유형은 사교적이고 쾌활한 성격을 지닌 사람들로, 현재의 순간을 즐기는 데 능숙합니다. 이들은 사람들과 함께하는 것을 좋아하고, 타인의 관심을 받는 것을 즐깁니다. 감각적이고 외향적인 성향을 지니며, 사람들과의 관계에서 즐거움과 행복을 추구하는 경향이 강합니다.',
  ENFP: 'ENFP 유형은 열정적이고 창의적인 성향을 지닌 사람들로, 새로운 가능성을 탐구하는 것을 즐깁니다. 이들은 타인의 감정에 공감하고, 사람들과의 관계에서 감정적 유대감을 중요시합니다. 독창적인 아이디어를 통해 문제를 해결하고, 자신만의 방식으로 세상을 탐험하는 것을 좋아합니다.',
  ENTP: 'ENTP 유형은 논쟁을 즐기고, 창의적인 문제 해결 능력을 지닌 사람들입니다. 이들은 도전적인 상황을 두려워하지 않고, 새로운 아이디어를 탐구하며, 상황에 따라 다양한 접근 방식을 취하는 것을 좋아합니다. 논리적이고 비판적인 사고를 바탕으로 창의적인 해결책을 제시하는 데 능숙합니다.',
  ESTJ: 'ESTJ 유형은 체계적이고 효율적인 성향을 지닌 사람들로, 목표 달성에 매우 집중합니다. 이들은 조직적이고 규율을 중시하며, 타인을 이끌고 관리하는 데 능숙합니다. 현실적이고 실용적인 접근 방식을 통해 문제를 해결하며, 사회적 책임과 규범을 중요시하는 경향이 있습니다.',
  ESFJ: 'ESFJ 유형은 사교적이고 따뜻한 성격을 지닌 사람들로, 타인의 감정을 이해하고 배려하는 데 능숙합니다. 이들은 다른 사람들과 조화를 이루고, 사람들과의 관계에서 감정적 유대감을 형성하는 것을 중요하게 생각합니다. 전통적인 가치와 사회적 규범을 중시하며, 다른 사람들의 요구에 민감하게 반응합니다.',
  ENFJ: 'ENFJ 유형은 카리스마 있고 공감 능력이 뛰어난 성격을 지닌 사람들로, 타인의 감정을 깊이 이해하고 그들을 이끄는 데 탁월합니다. 이들은 사람들과의 관계에서 신뢰와 유대감을 형성하며, 자신의 비전과 목표를 통해 사람들을 하나로 모으는 리더십을 발휘합니다.',
  ENTJ: 'ENTJ 유형은 결단력 있고 목표 지향적인 성향을 지닌 사람들로, 타고난 리더십을 발휘합니다. 이들은 논리적이고 체계적인 사고를 통해 목표를 설정하고, 이를 달성하기 위해 전략적으로 행동합니다. 도전적인 상황을 즐기며, 문제 해결에 있어서 효율성과 결단력을 중시합니다.'
};
